<template>
  <Story
    id="api"
    title="API Reference"
    docs-only
    icon="carbon:bookmark"
    :actions="{ disable: true }"
  />
</template>

<docs lang="md">
# 📘 API Reference

### AppAlert

| Название        | Тип                 | Описание            |
| --------------- | ------------------- | ------------------- |
| `title`         | `string`            | Заголовок           |
| `text`          | `string`            | Основной текст      |
| `visible`       | `boolean`           | Отображение/скрытие |
| `styleStrategy` | `primary \| danger` | Визуальный стиль    |

#### События:

`@close` — вызывается при нажатии на кнопку "Закрыть"

### AppButton

| Название        | Тип                                  | Описание         |
| --------------- | ------------------------------------ | ---------------- |
| `type`          | `'button' \| 'submit' \| 'reset'`    | Тип HTML-кнопки  |
| `class`         | `string`                             | Основной текст   |
| `styleStrategy` | `'primary' \| 'danger' \| 'neutral'` | Визуальный стиль |

#### События:

`@click` — вызывается при клике

### AppInput

| Название       | Тип       | Описание                              |
| -------------- | --------- | ------------------------------------- |
| `modelValue`   | `string`  | Значение поля                         |
| `placeholder`  | `string`  | Текст-подсказка                       |
| `type`         | `string`  | Тип поля (`text`, `password`, и т.д.) |
| `autocomplete` | `string`  | Подсказки автозаполнения браузера     |
| `error`        | `string`  | Текст ошибки                          |
| `withError`    | `boolean` | Отображение блока с ошибкой           |

#### События:

`@update:modelValue` — вызывается при изменении значения

`@focus` — вызывается при фокусе на поле

### AppModal

| Название  | Тип       | Описание                    |
| --------- | --------- | --------------------------- |
| `visible` | `boolean` | Отображение модального окна |

#### События:

`@close` — вызывается при нажатии на кнопку "Закрыть"

### AppSelect

| Название     | Тип                                     | Описание               |
| ------------ | --------------------------------------- | ---------------------- |
| `modelValue` | `string`                                | ID выбранного значения |
| `options`    | `{ id: string; displayName: string }[]` | Список доступных опций |

#### События:

`@update:modelValue` — вызывается при выборе опции

### AppTable

| Название             | Тип       | Описание                       |
| -------------------- | --------- | ------------------------------ |
| `table`              | `ITable`  | Табличные данные               |
| `emptyText`          | `string`  | Текст при отсутствии данных    |
| `emptyHeightInRows`  | `number`  | Высота пустого блока в строках |
| `initialRowHeight`   | `number`  | Высота строки таблицы (в px)   |
| `debugComputedTable` | `boolean` | Включить логирование таблицы   |

### AppDropdown

| Название     | Тип                 | Описание               |
| ------------ | ------------------- | ---------------------- |
| `modelValue` | `string \| null`    | ID выбранного значения |
| `options`    | `IDropdownOption[]` | Список доступных опций |
| `zIndex`     | `number`            | z-index                |

#### События:

`@update:modelValue` — вызывается при выборе опции
</docs>

<style>
.histoire-toolbar-open-in-editor {
  display: none;
}
</style>
